{
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v3.13.0",
    "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                32,
                                32,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_1"
                        },
                        "name": "input_1",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d",
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_1",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_1",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_2",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_1",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_2",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_2",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_3",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_2",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_2",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_3",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_3",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_4",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_4",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_3",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_3",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_4",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_4",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_5",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_5",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_4",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_4",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_5",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_5",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_6",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_6",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_5",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_5",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_6",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_6",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_7",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_7",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_6",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_6",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_7",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_7",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_8",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_8",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_7",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_7",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_8",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_8",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_9",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_9",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_8",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.0,
                            "epsilon": 0.0001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_8",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_9",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_9",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_9",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_10",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
