{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_166", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_166", "inbound_nodes": [[["sequential", 1, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_164", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_164", "inbound_nodes": [[["conv2d_166", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_164", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_164", "inbound_nodes": [[["batch_normalization_164", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_165", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_165", "inbound_nodes": [[["re_lu_164", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_165", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_165", "inbound_nodes": [[["batch_normalization_165", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_168", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_168", "inbound_nodes": [[["re_lu_165", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_166", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_166", "inbound_nodes": [[["conv2d_168", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_166", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_166", "inbound_nodes": [[["batch_normalization_166", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_169", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_169", "inbound_nodes": [[["re_lu_166", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_167", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_167", "inbound_nodes": [[["conv2d_169", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_167", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_167", "inbound_nodes": [[["batch_normalization_167", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_167", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_167", "inbound_nodes": [[["re_lu_164", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_170", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_170", "inbound_nodes": [[["re_lu_167", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_54", "trainable": true, "dtype": "float32"}, "name": "add_54", "inbound_nodes": [[["conv2d_167", 0, 0, {}], ["conv2d_170", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_168", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_168", "inbound_nodes": [[["add_54", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_168", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_168", "inbound_nodes": [[["batch_normalization_168", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_171", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_171", "inbound_nodes": [[["re_lu_168", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_169", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_169", "inbound_nodes": [[["conv2d_171", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_169", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_169", "inbound_nodes": [[["batch_normalization_169", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_172", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_172", "inbound_nodes": [[["re_lu_169", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_170", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_170", "inbound_nodes": [[["conv2d_172", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_170", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_170", "inbound_nodes": [[["batch_normalization_170", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_173", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_173", "inbound_nodes": [[["re_lu_170", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_55", "trainable": true, "dtype": "float32"}, "name": "add_55", "inbound_nodes": [[["conv2d_173", 0, 0, {}], ["add_54", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_171", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_171", "inbound_nodes": [[["add_55", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_171", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_171", "inbound_nodes": [[["batch_normalization_171", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_175", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_175", "inbound_nodes": [[["re_lu_171", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_172", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_172", "inbound_nodes": [[["conv2d_175", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_172", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_172", "inbound_nodes": [[["batch_normalization_172", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_176", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_176", "inbound_nodes": [[["re_lu_172", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_173", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_173", "inbound_nodes": [[["conv2d_176", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_173", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_173", "inbound_nodes": [[["batch_normalization_173", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_174", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_174", "inbound_nodes": [[["add_55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_177", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_177", "inbound_nodes": [[["re_lu_173", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_56", "trainable": true, "dtype": "float32"}, "name": "add_56", "inbound_nodes": [[["conv2d_174", 0, 0, {}], ["conv2d_177", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_174", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_174", "inbound_nodes": [[["add_56", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_174", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_174", "inbound_nodes": [[["batch_normalization_174", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_178", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_178", "inbound_nodes": [[["re_lu_174", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_175", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_175", "inbound_nodes": [[["conv2d_178", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_175", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_175", "inbound_nodes": [[["batch_normalization_175", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_179", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_179", "inbound_nodes": [[["re_lu_175", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_176", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_176", "inbound_nodes": [[["conv2d_179", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_176", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_176", "inbound_nodes": [[["batch_normalization_176", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_180", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_180", "inbound_nodes": [[["re_lu_176", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_57", "trainable": true, "dtype": "float32"}, "name": "add_57", "inbound_nodes": [[["conv2d_180", 0, 0, {}], ["add_56", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_177", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_177", "inbound_nodes": [[["add_57", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_177", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_177", "inbound_nodes": [[["batch_normalization_177", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_182", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_182", "inbound_nodes": [[["re_lu_177", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_178", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_178", "inbound_nodes": [[["conv2d_182", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_178", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_178", "inbound_nodes": [[["batch_normalization_178", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_183", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_183", "inbound_nodes": [[["re_lu_178", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_179", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_179", "inbound_nodes": [[["conv2d_183", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_179", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_179", "inbound_nodes": [[["batch_normalization_179", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_181", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_181", "inbound_nodes": [[["add_57", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_184", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_184", "inbound_nodes": [[["re_lu_179", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_58", "trainable": true, "dtype": "float32"}, "name": "add_58", "inbound_nodes": [[["conv2d_181", 0, 0, {}], ["conv2d_184", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_180", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_180", "inbound_nodes": [[["add_58", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_180", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_180", "inbound_nodes": [[["batch_normalization_180", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_185", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_185", "inbound_nodes": [[["re_lu_180", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_181", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_181", "inbound_nodes": [[["conv2d_185", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_181", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_181", "inbound_nodes": [[["batch_normalization_181", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_186", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_186", "inbound_nodes": [[["re_lu_181", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_182", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_182", "inbound_nodes": [[["conv2d_186", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_182", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_182", "inbound_nodes": [[["batch_normalization_182", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_187", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_187", "inbound_nodes": [[["re_lu_182", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_59", "trainable": true, "dtype": "float32"}, "name": "add_59", "inbound_nodes": [[["conv2d_187", 0, 0, {}], ["add_58", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_183", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_183", "inbound_nodes": [[["add_59", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_183", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_183", "inbound_nodes": [[["batch_normalization_183", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "name": "average_pooling2d_1", "inbound_nodes": [[["re_lu_183", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d_1", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "softmax", "trainable": true, "dtype": "float32", "axis": -1}}], "input_layers": [["input_2", 0, 0]], "output_layers": [["tf.compat.v1.nn.softmax_1", 0, 0]]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.1}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.0009999999310821295, "decay": 0.0, "momentum": 0.8999999761581421, "nesterov": false}}}}, "weightsManifest": [{"paths": ["cifar10_resnet20.bin"], "weights": [{"name": "batch_normalization_164/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_164/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_164/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_164/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_165/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_165/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_165/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_165/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_166/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_166/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_166/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_166/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_167/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_167/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_167/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_167/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_168/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_168/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_168/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_168/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_169/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_169/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_169/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_169/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_170/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_170/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_170/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_170/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_171/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_171/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_171/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_171/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_172/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_172/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_172/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_172/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_173/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_173/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_173/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_173/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_174/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_174/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_174/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_174/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_175/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_175/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_175/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_175/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_176/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_176/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_176/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_176/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_177/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_177/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_177/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_177/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_178/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_178/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_178/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_178/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_179/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_179/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_179/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_179/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_180/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_180/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_180/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_180/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_181/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_181/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_181/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_181/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_182/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_182/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_182/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_182/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_183/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_183/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_183/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_183/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_166/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_167/kernel", "shape": [1, 1, 16, 64], "dtype": "float32"}, {"name": "conv2d_168/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "conv2d_169/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_170/kernel", "shape": [1, 1, 16, 64], "dtype": "float32"}, {"name": "conv2d_171/kernel", "shape": [1, 1, 64, 16], "dtype": "float32"}, {"name": "conv2d_172/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_173/kernel", "shape": [1, 1, 16, 64], "dtype": "float32"}, {"name": "conv2d_174/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2d_175/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_176/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_177/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2d_178/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "conv2d_179/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_180/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2d_181/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv2d_182/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2d_183/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_184/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv2d_185/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv2d_186/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_187/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [256, 10], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}]}]}